{
  "categories": [
    {
      "id": "morning",
      "name": "Morning Duas",
      "duas": [
        {
          "id": "morning1",
          "title": "Morning Dua for Protection",
          "arabic": "أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ، وَالْحَمْدُ لِلَّهِ، لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ",
          "roman": "Asbahna wa asbahal mulku lillahi, wal hamdu lillahi, la ilaha illallahu wahdahu la sharika lah",
          "translation": "We have reached the morning and at this very time all sovereignty belongs to Allah. Praise is for Allah. There is none worthy of worship but Allah alone, who has no partner.",
          "reference": "Muslim 4/2088",
          "benefits": "Whoever says this in the morning will be protected until evening, and whoever says it in the evening will be protected until morning."
        },
        {
          "id": "morning2",
          "title": "Dua for Morning",
          "arabic": "اللَّهُمَّ بِكَ أَصْبَحْنَا، وَبِكَ أَمْسَيْنَا، وَبِكَ نَحْيَا، وَبِكَ نَمُوتُ، وَإِلَيْكَ النُّشُورُ",
          "roman": "Allahumma bika asbahna, wa bika amsayna, wa bika nahya, wa bika namutu, wa ilaikan nushur",
          "translation": "O Allah, by You we enter the morning, and by You we enter the evening, and by You we live, and by You we die, and to You is the resurrection.",
          "reference": "Tirmidhi 3391",
          "benefits": "Reciting this brings blessings throughout the day."
        }
      ]
    },
    {
      "id": "evening",
      "name": "Evening Duas",
      "duas": [
        {
          "id": "evening1",
          "title": "Evening Dua for Protection",
          "arabic": "أَمْسَيْنَا وَأَمْسَى الْمُلْكُ لِلَّهِ، وَالْحَمْدُ لِلَّهِ، لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ",
          "roman": "Amsayna wa amsal mulku lillahi, wal hamdu lillahi, la ilaha illallahu wahdahu la sharika lah",
          "translation": "We have reached the evening and at this very time all sovereignty belongs to Allah. Praise is for Allah. There is none worthy of worship but Allah alone, who has no partner.",
          "reference": "Muslim 4/2088",
          "benefits": "Protection throughout the night from all harm."
        }
      ]
    },
    {
      "id": "sleep",
      "name": "Sleep Duas",
      "duas": [
        {
          "id": "sleep1",
          "title": "Dua Before Sleeping",
          "arabic": "بِاسْمِكَ اللَّهُمَّ أَمُوتُ وَأَحْيَا",
          "roman": "Bismika Allahumma amutu wa ahya",
          "translation": "In Your name, O Allah, I die and I live.",
          "reference": "Bukhari 6324",
          "benefits": "Protection during sleep and easy awakening."
        },
        {
          "id": "sleep2",
          "title": "Ayat-ul-Kursi Before Sleep",
          "arabic": "اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ۚ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ مَن ذَا الَّذِي يَشْفَعُ عِندَهُ إِلَّا بِإِذْنِهِ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلَّا بِمَا شَاءَ ۚ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ ۖ وَلَا يَئُودُهُ حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ الْعَظِيمُ",
          "roman": "Allahu la ilaha illa Huwal Hayyul Qayyoom. Laa ta'khuzuhu sinatuw wa laa nawm. Lahu maa fis samaawaati wa maa fil ardh. Man zal lazee yashfa'u indahu illa bi iznih. Ya'lamu maa baina aideehim wa maa khalfahum. Wa laa yuhituna bishai'im min ilmihi illa bima shaa. Wasi'a kursiyyuhus samaawaati wal ardh. Wa laa ya'ooduhu hifzuhumaa. Wa Huwal Ali-yyul Azeem.",
          "translation": "Allah! There is no god but He, the Living, the Self-subsisting, Eternal. No slumber can seize Him nor sleep. His are all things in the heavens and on earth. Who is there can intercede in His presence except as He permits? He knows what appears to His creatures as before or after or behind them. Nor shall they compass aught of His knowledge except as He wills. His Throne extends over the heavens and the earth, and He feels no fatigue in guarding and preserving them for He is the Most High, the Supreme.",
          "reference": "Quran 2:255",
          "benefits": "Whoever recites this ayat before sleeping will be under Allah's protection until morning."
        }
      ]
    },
    {
      "id": "eating",
      "name": "Eating Duas",
      "duas": [
        {
          "id": "eating1",
          "title": "Dua Before Eating",
          "arabic": "بِسْمِ اللَّهِ",
          "roman": "Bismillah",
          "translation": "In the name of Allah.",
          "reference": "Bukhari 5376",
          "benefits": "Blessings in the food and protection from Shaytan."
        },
        {
          "id": "eating2",
          "title": "Dua After Eating",
          "arabic": "الْحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنَا وَسَقَانَا وَجَعَلَنَا مُسْلِمِينَ",
          "roman": "Alhamdu lillahil lazee at'amana wa saqana wa ja'alana muslimeen",
          "translation": "All praise is for Allah who fed us and gave us drink and made us Muslims.",
          "reference": "Abu Dawud 3850",
          "benefits": "Gratitude to Allah for His provisions."
        }
      ]
    },
    {
      "id": "travel",
      "name": "Travel Duas",
      "duas": [
        {
          "id": "travel1",
          "title": "Dua When Boarding a Vehicle",
          "arabic": "سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَٰذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ وَإِنَّا إِلَىٰ رَبِّنَا لَمُنقَلِبُونَ",
          "roman": "Subhanallazi sakkhara lana haza wa ma kunna lahu muqrineen, wa inna ila Rabbina lamunqalibun",
          "translation": "Glory is to Him Who has provided this for us though we could never have had it by our efforts. Indeed, to our Lord we will return.",
          "reference": "Quran 43:13",
          "benefits": "Safety during travel and gratitude for transportation."
        },
        {
          "id": "travel2",
          "title": "Dua for Journey",
          "arabic": "اللَّهُمَّ هَوِّنْ عَلَيْنَا سَفَرَنَا هَذَا وَاطْوِ عَنَّا بُعْدَهُ",
          "roman": "Allahumma hawwin alaina safarana hadha watwi anna bu'dah",
          "translation": "O Allah, make this journey easy for us and shorten its distance.",
          "reference": "Muslim 1927",
          "benefits": "Ease and safety during travel."
        }
      ]
    },
    {
      "id": "general",
      "name": "General Duas",
      "duas": [
        {
          "id": "general1",
          "title": "Dua for Anxiety and Sadness",
          "arabic": "اللَّهُمَّ إِنِّي عَبْدُكَ، وَابْنُ عَبْدِكَ، وَابْنُ أَمَتِكَ، نَاصِيَتِي بِيَدِكَ، مَاضٍ فِيَّ حُكْمُكَ، عَدْلٌ فِيَّ قَضَاؤُكَ، أَسْأَلُكَ بِكُلِّ اسْمٍ هُوَ لَكَ، سَمَّيْتَ بِهِ نَفْسَكَ، أَوْ أَنْزَلْتَهُ فِي كِتَابِكَ، أَوْ عَلَّمْتَهُ أَحَدًا مِنْ خَلْقِكَ، أَوِ اسْتَأْثَرْتَ بِهِ فِي عِلْمِ الْغَيْبِ عِنْدَكَ، أَنْ تَجْعَلَ الْقُرْآنَ رَبِيعَ قَلْبِي، وَنُورَ صَدْرِي، وَجَلَاءَ حُزْنِي، وَذَهَابَ هَمِّي",
          "roman": "Allahumma inni abduka, wabnu abdika, wabnu amatika, nasiyati biyadika, madhin fiyya hukmuka, adlun fiyya qada'uka, as'aluka bikulli ismin huwa laka, sammayta bihi nafsaka, aw anzaltahu fi kitabika, aw allamtahu ahadan min khalqika, aw ista'tharta bihi fi ilmil ghaybi indaka, an taj'alal qurana rabi'a qalbi, wa nura sadri, wa jala'a huzni, wa dhahaba hammi",
          "translation": "O Allah, I am Your slave and the son of Your male slave and the son of Your female slave. My forehead is in Your hand. Your command over me is forever executed and Your decree over me is just. I ask You by every name belonging to You which You have named Yourself with, or revealed in Your Book, or You taught to any of Your creation, or You have preserved in the knowledge of the unseen with You, that You make the Qur'an the life of my heart and the light of my breast, and a departure for my sorrow and a release for my anxiety.",
          "reference": "Ahmad 1/391",
          "benefits": "Relief from anxiety, sadness, and worries."
        },
        {
          "id": "general2",
          "title": "Dua for Seeking Knowledge",
          "arabic": "اللَّهُمَّ انْفَعْنِي بِمَا عَلَّمْتَنِي، وَعَلِّمْنِي مَا يَنْفَعُنِي، وَزِدْنِي عِلْمًا",
          "roman": "Allahummanfa'ni bima allamtani, wa allimni ma yanfa'uni, wa zidni ilma",
          "translation": "O Allah, benefit me with what You have taught me, teach me what will benefit me, and increase me in knowledge.",
          "reference": "Ibn Majah 251",
          "benefits": "Increase in beneficial knowledge and wisdom."
        }
      ]
    }
  ]
}